#include <iostream>
#include <cmath>
using namespace std;

int main () {
    int choice = 0;

        do {
            cout << "    Выполнил: Банчук Георгий, гр.653501" << endl;
            cout << "Необходимо разложить функцию Y(x) из своего варианта в ряд S(x),затем с помощью полученного ряда найти значение функции и сравнить его со значением, вычисленным с помощью стандартных функций. программа должна запросить у пользователя количество членов ряда (n), затем запросить у пользователя количество чисел, от которых он хочет посчитать функцию, затем пользователь вводит по одному числу (x от 0.1, до 1), программа считает значение функции с помощью ряда и с помощью стандартных функций и выводит оба значения. Постройте блок-схему алгоритма." << endl;
            cout << "---------------------------------------" << endl;
            cout << "1. Запустить выполнение программы" << endl;
            cout << "2. Выйти из программы" << endl;
            cout << "Выберите действие (1-2): ";

        while (!(cin >> choice) || choice < 1 || choice > 2) {
            cout << "Некорректный ввод! Введите число 1 или 2: ";
            cin.clear(); 
            cin.ignore(100, '\n');
        }

        
        if (choice == 1){
            int n = 0;
            int countX = 0;
            
            cout << "Введите количество членов ряда n (n >= 1): ";
            while (!(cin >> n) || n < 1) {
                cout << "Некорректный ввод! Введите целое число от 1: ";
                cin.clear();
                cin.ignore(100, '\n');
            }
            cout << "Введите количество чисел,от которых надо посчитать функцию (x): ";
            while (!(cin >> countX) || countX < 1) {
                cout << "Некорректный ввод! Введите целое число от 1: ";
                cin.clear();
                cin.ignore(100, '\n');
            }
            for (int i {1}; i <= countX; i++){
                double x = 0.0;
                cout << "Введите x от 0.1, до 1: ";

                while (!(cin >> x) || x > 1 || x < 0.1) {
                    cout << "Некорректный ввод! Введите число в диапазоне [0.1;1]: ";
                    cin.clear();
                    cin.ignore(100, '\n');    
            }
            double znach = 1.0;
            double sumSx = 1.0; 
            for (int k {1} ; k <= n ; k++){
                znach = (pow(x,2) * znach) / ((2*k - 1) * (2*k));
                sumSx += znach;
            }
            double sumYx = (exp(x) + exp(-x) ) / 2.0;
            cout << "Через готовую формулу для Y(x): " << sumYx << endl;
            cout << "Через разложение с помощью ряда S(x): " << sumSx << endl;
            }
            
        }
    } while (choice != 2);
     
    return 0;
}

